Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/tutorial.tmx
Source language: en
Languages: pt

source: Usually, the local scope references the local names of the (textually) current function. Outside functions, the local scope references the same namespace as the global scope: the module's namespace. Class definitions place yet another namespace in the local scope.
pt: Normalmente o escopo local referencia os nomes locais da função corrente. Fora de funções, o escopo local referencia os nomes do escopo global (namespace do módulo). Definições de classes também adicionam um espaço de nomes ao escopo local.

source: It is important to realize that scopes are determined textually: the global scope of a function defined in a module is that module's namespace, no matter from where or by what alias the function is called. On the other hand, the actual search for names is done dynamically, at run time --- however, the language definition is evolving towards static name resolution, at "compile" time, so don't rely on dynamic name resolution! (In fact, local variables are already determined statically.)
pt: É importante perceber que os escopos são determinados textualmente. O escopo global de uma função definida em um módulo é namespace do módulo, não importa da onde ou por quem a função é chamada. Por outro lado, a busca de nomes é dinâmica e ocorre em tempo de execução. Entretanto, a evolução da linguagem está caminhando para uma resolução de nomes estática, em tempo de compilação, que não dependa de resolução dinâmica de nomes. (De fato, variáveis locais já são resolvidas estaticamente.)

source: Scopes and Namespaces Example
pt: Exemplo de Escopos e Namespaces

source: This is an example demonstrating how to reference the different scopes and namespaces, and how :keyword:`global` and :keyword:`nonlocal` affect variable binding::
pt: Esse é um exemplo que demonstra como referenciar diferentes escopos e namespaces, e como :keyword:`global` e :keyword:`nonlocal` afetam a atribuição das variáveis::

source: The output of the example code is::
pt: A saída do código de exemplo é:

source: A First Look at Classes
pt: Primeira Contato Com Classes

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
pt: As classes introduzem um pouco da nova sintaxe, três novos tipos de objetos e uma semântica nova.

source: Class Definition Syntax
pt: Sintaxe da Definição de Classes

source: The simplest form of class definition looks like this::
pt: A forma mais simples de definição de classe se parece com isto:

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
pt: A definições de classes, assim como definições de funções (comandod :keyword:`def`) devem ser executadas antes que tenham qualquer efeito. Você pode colocar uma definição de classe após um teste condicional :keyword:`if` ou dentro de uma função.

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
pt: Na prática, os comandos dentro de uma classe normalmente são definições de funções, mas existem outros comandos que são permitidos. Definições de funções dentro da classe possuem um lista peculiar de argumentos, determinada pela convenção de chamada a métodos. Novamente, será explicado mais tarde.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
pt: Quando se fornece uma definição de classe, um novo namespace é criado e usado como o escopo local. Dessa forma, todas atribuições de variáveis são vinculadas ao novo namespace. Em particular, definições de funções também são armazenadas neste escopo.

source: Class Objects
pt: Objetos Classes

source: Class objects support two kinds of operations: attribute references and instantiation.
pt: Classes suportam dois tipos de operações: referências a atributos e instanciação

source: class MyClass: """A simple example class""" i = 12345 def f(self): return 'hello world'
pt: class MyClass: """Um exemplo simples de classe""" i = 12345 def f(self): return 'hello world'

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
pt: *Instanciação* de classes também utilizam a notação de função. Apenas finja que o objeto classe não possui parâmetros e retorna uma nova instância da classe. Por exemplo::

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
pt: cria uma nova *instância* da classe e atribui o objeto resultante a variável local ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`__init__`, like this::
pt: A operação de instanciação (a “chamada” de um objeto classe) cria um objeto vazio. Muitas classes preferem criar um novo objeto em um estado inicial pré-determinado. Para fazer isso, a classe pode definir método especial chamado :meth:` __init__()`, veja::

source: When a class defines an :meth:`__init__` method, class instantiation automatically invokes :meth:`__init__` for the newly-created class instance. So in this example, a new, initialized instance can be obtained by::
pt: Quando uma classe define um método :meth:`__init__()`, o processo de instanciação automaticamente invoca o :meth:`__init__()` para a recém-criada instância da classe. Neste exemplo, uma nova intância já inicializada pode ser obtida por::

source: Of course, the :meth:`__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`__init__`. For example, ::
pt: Naturalmente, o método :meth:`__init__()` pode ter argumentos para aumentar sua flexibilidade. Neste caso, os argumentos fornecidos na instanciação da classe são passados para o método :meth:`__init__()`. Por exemplo::

source: Instance Objects
pt: Instâncias

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names, data attributes and methods.
pt: Agora, o que podemos fazer com instâncias? As únicas operações que as instâncias conhecem são os atributos de referências. Existem dois tipos de atributos válidos: atributos de dados e métodos.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
pt: *Atributos de dados* correspondem às "variáveis de instância" em Smalltalk e aos "membros" em C++. Atributos de dados não precisam ser declarados. Assim como as variáveis locais, eles passam a existir na primeira vez em que é feita uma atribuição. Por exemplo, se ``x`` é uma instância de :class:`MyClass` criada acima, o trecho de código a seguir irá imprimir o valor ``16``, sem deixar rastro (por causa do ``del``)::

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object. (In Python, the term method is not unique to class instances: other object types can have methods as well. For example, list objects have methods called append, insert, remove, sort, and so on. However, in the following discussion, we'll use the term method exclusively to mean methods of class instance objects, unless explicitly stated otherwise.)
pt: O outro tipo de atributos de referências é chamado de *método*. Uma método é uma função que "pertence" à um objeto. (No Python, o termo método não é exclusivo à instâncias de classes: outros tipos de objetos também podem ter métodos. Por exemplo, objetos listas possuem métodos chamados append, insert, remove, sort, etc... Todavia, na próxima parte nós usaremos o termo método exclusivamente para métodos de instâncias de classes, a menos que seja dito o contrário.)

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
pt: Nomes de métodos válidos de uma instância dependem de sua classe. Por definição, todos atributos de uma classe que são funções equivalem à um método de suas instâncias. Então em nosso exemplo, ``x.f`` é uma referência de método válida pois ``MyClass.f`` é uma função, enquanto ``x.i`` não é, já que ``MyClass.i`` não é. Contudo, ``x.f``não é a mesma coisa que ``MyClass.f`` --- o primeiro é um método de objeto, o segundo é um objeto função.

source: Method Objects
pt: Métodos de Objetos

source: Usually, a method is called right after it is bound::
pt: Normalmente, um método é chamado imediatamente::

source: In the :class:`MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
pt: No exemplo com :class:`MyClass`, o resultado será a string ``'hello world'``. No entanto, não é necessário chamar o método imediatamente: como ``x.f`` é também um objeto (tipo método), ele pode ser armazenado e invocado mais tarde. Por exemplo::

source: will continue to print ``hello world`` until the end of time.
pt: continuará imprimindo ``hello world`` até o final dos tempos.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
pt: O que exatamente ocorre quando um método é chamado? Você deve ter notado que ``x.f()`` foi chamado sem nenhum parâmetro, porém a definição da função :meth: `f` especificava um argumento. O que aconteceu com o argumento? Certamente o Python lançaria uma exceção se o argumento estivesse faltando...

source: Actually, you may have guessed the answer: the special thing about methods is that the object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's object before the first argument.
pt: Talvez você já tenha adivinhado a resposta: o que há de especial em métodos é que objeto (a qual o método pertence) é passado como o primeiro argumento da função. No nosso exemplo, a chamada ``x.f()``é exatamente equivalente ao ``MyClass.f(x)``. Em geral, chamar um método com uma lista de *n* argumentos é equivalente à chamar a função correspondente na classe passando a instância como o primeiro parâmetro antes dos demais argumentos.

source: If you still don't understand how methods work, a look at the implementation can perhaps clarify matters. When an instance attribute is referenced that isn't a data attribute, its class is searched. If the name denotes a valid class attribute that is a function object, a method object is created by packing (pointers to) the instance object and the function object just found together in an abstract object: this is the method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
pt: Se você ainda não entendeu como os métodos funcionam, talvez uma olhadela na implementação possa clarear as coisas. Quando um atributo de instância é referenciado e não é um atributo de dado, a sua classe é procurada. Se o nome indica um atributo de classe válido que seja um objeto função, um objeto método é criado pela composição da instância alvo e do objeto função. Quando o método é chamado com uma lista de argumentos, uma nova lista de argumentos é construída a partir da instância do objeto e a lista original de argumentos. Finalmente a função é chamada com a nova lista de argumentos.

source: Random Remarks
pt: Observações Aleatórias

source: Data attributes override method attributes with the same name; to avoid accidental name conflicts, which may cause hard-to-find bugs in large programs, it is wise to use some kind of convention that minimizes the chance of conflicts. Possible conventions include capitalizing method names, prefixing data attribute names with a small unique string (perhaps just an underscore), or using verbs for methods and nouns for data attributes.
pt: Atributos de dados sobrescrevem atributos métodos de mesmo nome. Para evitar conflitos acidentais de nomes, os quais podem causar erros difíceis de achar em programas grandes, é sábio utilizar algum tipo de convenção de nomes que minimize a chance de conflitos. Algumas sugestões incluem colocar métodos com a letra inicial em maiúscula, prefixar atributos de dados com uma string única (talvez "_"), ou simplesmente usar verbos para métodos e substantivos para atributos de dados.

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
pt: Atributos de dados podem ser referenciados por métodos da própria instância, bem como qualquer outro usuário do objeto. Em outras palavras, classes não servem para implementar tipos puramente abstratos de dados. De fato, nada em Python torna possível assegurar o ocultamento das informações --- tudo é baseado em convenções. Por outro lado, a implementação do Python escrita em C, pode esconder completamente detalhes de objeto e regular o acesso a ele se necessário. Isso pode ser usado por extensões do Python escritas em C.

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
pt: Clientes devem usar atributos de dados com cuidado, pois podem bagunçar invariantes mantidos pelos métodos ao esbarrar nos seus atributos. Portanto, clientes podem adicionar à vontade atributos para uma instância sem afetar a validade dos métodos, desde que seja evitado o conflito de nomes. Novamente, uma convenção de nomes pode poupar muita dor de cabeça.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
pt: Não existe atalho para referenciar atributos de dados (ou métodos) de dentro de um método. Isso na verdade aumenta a legibilidade dos métodos: não há chances de confundir uma variável local com uma instância global ao olhar um método desconhecido.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
pt: Freqüentemente, o primeiro argumento de um método é chamado ``self``. Isso não é nada mais do que uma convenção --- o nome ``self`` não tem nenhum significado especial em Python. Note que se você não seguir a convenção seu código pode se tornar menos legível para programadores Python e isso pode dificultar o uso de ferramentas que se baseie na convenção.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
pt: Qualquer função que também é um atributo de classe, define um método para instâncias dessa classe. Não é necessário que a definição da função esteja textualmente embutida na definição da classe. Atribuir um objeto função à uma variável local da classe é válido. Por exemplo::

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`C` that refer to function objects, and consequently they are all methods of instances of :class:`C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
pt: Agora ``f``, ``g`` e ``h`` são todos atributos da classe :class:`C` que referenciam funções e conseqüentemente são todos métodos das instâncias da classe :class:`C` --- ``h`` é equivalente a ``g``. No entanto essa prática pode confundir o leitor do programa.

source: Methods may call other methods by using method attributes of the ``self`` argument::
pt: Métodos podem chamar outros métodos utilizando o argumento ``self``::

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing the class definition. (The class itself is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
pt: Métodos podem referenciar nomes globais da mesma forma que funções ordinárias. O escopo global associado à um método é o módulo contendo sua definição de classe (a classe propriamente dita nunca é usada como escopo global!). Ainda que seja raro encontrar a necessidade de utilizar dados globais em um método, há diversos usos legítimos do escopo global. Por exemplo, funções e módulos importados no escopo global podem ser usados por métodos, bem como as funções e classes definidas no próprio escopo global. Provavelmente, a classe contendo o método em questão também foi definida neste escopo global. Na próxima seção veremos um conjunto de razões pelas quais um método desejaria referenciar sua própria classe.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
pt: Cada valor é um objeto, e portanto tem uma *classe* (também chamada de *tipo*). A classe é guardada em ``object.__class__``.

source: Inheritance
pt: Herança

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
pt: Obviamente, uma característica da linguagem não seria digna do nome “classe” se não suportasse herança. A sintaxe para uma classe derivada se parece com::

source: The name :class:`BaseClassName` must be defined in a scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
pt: O nome :class:`BaseClassName` deve estar definido em um escopo contendo a definição da classe derivada. No lugar do nome da classe base, também são aceitas outras expressões. Isso é muito útil, por exemplo, quando a classe base é definida em outro módulo::

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
pt: Execução de uma definição de classe derivada procede da mesma forma que a de uma classe base. Quando o objeto classe é construído, a classe base é lembrada. Isso é utilizado para resolver referências a atributos. Se um atributo requisitado não for encontrado na classe, ele é procurado na classe base. Essa regra é aplicada recursivamente se a classe base por sua vez for derivada de outra.

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
pt: Não existe nada de especial sobre instanciação de classes derivadas. ``DerivedClassName()`` cria uma nova instância da classe. Referências a métodos são resolvidas da seguinte forma: o atributo correspondente é procurado através da cadeia de derivação, e referências a métodos são válidas desde que produzam um objeto do tipo função.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
pt: Classes derivadas podem sobrescrever métodos das suas classes base. Uma vez que métodos não possuem privilégios especiais quando invocam outros métodos no mesmo objeto, um método na classe base que invocava um outro método da mesma classe base, pode efetivamente acabar invocando um método sobreposto por uma classe derivada. Para programadores C++ isso significa que todos os métodos em Python são efetivamente ``virtual``.
